---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.FabFittingFailed
source: html/78cc4aad-1d3d-587c-6756-e0fdde30d23f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.FabFittingFailed Property

The Fabrication Fitting was invalid

## Syntax (C#)
```csharp
public static FailureDefinitionId FabFittingFailed { get; }
```